In [65]:
# importing packeges
import numpy as np
import pandas as pd
import matplotlib.pyplot as plt
import seaborn as sns
%matplotlib inline

In [66]:
# import data
data = pd.read_csv("C:/Users/NOOMAN KHAN/Downloads/Data.csv")
x = data.iloc[:,:-1].values
y = data.iloc[:,-1].values
x

array([['France', 44.0, 72000.0],
       ['Spain', 27.0, 48000.0],
       ['Germany', 30.0, 54000.0],
       ['Spain', 38.0, 61000.0],
       ['Germany', 40.0, nan],
       ['France', 35.0, 58000.0],
       ['Spain', nan, 52000.0],
       ['France', 48.0, 79000.0],
       ['Germany', 50.0, 83000.0],
       ['France', 37.0, 67000.0]], dtype=object)

In [67]:
y

array(['No', 'Yes', 'No', 'No', 'Yes', 'Yes', 'No', 'Yes', 'No', 'Yes'],
      dtype=object)

In [68]:
from sklearn.impute import SimpleImputer
imputer = SimpleImputer(missing_values = np.nan , strategy='mean')

In [69]:
imputer.fit(x[:,1:3])
x[:,1:3] = imputer.transform(x[:,1:3])

In [70]:
x

array([['France', 44.0, 72000.0],
       ['Spain', 27.0, 48000.0],
       ['Germany', 30.0, 54000.0],
       ['Spain', 38.0, 61000.0],
       ['Germany', 40.0, 63777.77777777778],
       ['France', 35.0, 58000.0],
       ['Spain', 38.77777777777778, 52000.0],
       ['France', 48.0, 79000.0],
       ['Germany', 50.0, 83000.0],
       ['France', 37.0, 67000.0]], dtype=object)

In [71]:
data

   Country   Age   Salary Purchased
0   France  44.0  72000.0        No
1    Spain  27.0  48000.0       Yes
2  Germany  30.0  54000.0        No
3    Spain  38.0  61000.0        No
4  Germany  40.0      NaN       Yes
5   France  35.0  58000.0       Yes
6    Spain   NaN  52000.0        No
7   France  48.0  79000.0       Yes
8  Germany  50.0  83000.0        No
9   France  37.0  67000.0       Yes

In [72]:
data = pd.get_dummies(data = data , columns = ["Country"] , drop_first = True )

In [73]:
from sklearn.preprocessing import LabelEncoder
Encoder = LabelEncoder()
data['Purchased'] = Encoder.fit_transform(data["Purchased"])

In [74]:
data["Salary"].fillna(data["Salary"].median() , inplace = True)

In [75]:
data["Age"].fillna(data["Age"].median() , inplace = True)

In [76]:
data

    Age   Salary  Purchased  Country_Germany  Country_Spain
0  44.0  72000.0          0                0              0
1  27.0  48000.0          1                0              1
2  30.0  54000.0          0                1              0
3  38.0  61000.0          0                0              1
4  40.0  61000.0          1                1              0
5  35.0  58000.0          1                0              0
6  38.0  52000.0          0                0              1
7  48.0  79000.0          1                0              0
8  50.0  83000.0          0                1              0
9  37.0  67000.0          1                0              0

In [77]:
x = data[["Age" , "Salary", "Country_Germany" , "Country_Spain"]]
y = data[["Purchased"]]

In [89]:
from sklearn.model_selection import train_test_split
x_train , x_test , y_train , y_test = train_test_split(x , y , test_size = 0.2 , random_state=1)
x_train

    Age   Salary  Country_Germany  Country_Spain
6  38.0  52000.0                0              1
4  40.0  61000.0                1              0
0  44.0  72000.0                0              0
3  38.0  61000.0                0              1
1  27.0  48000.0                0              1
7  48.0  79000.0                0              0
8  50.0  83000.0                1              0
5  35.0  58000.0                0              0

In [79]:
print(x_train)
print(x_test)
print(y_train)
print(y_test)

    Age   Salary  Country_Germany  Country_Spain
6  38.0  52000.0                0              1
4  40.0  61000.0                1              0
0  44.0  72000.0                0              0
3  38.0  61000.0                0              1
1  27.0  48000.0                0              1
7  48.0  79000.0                0              0
8  50.0  83000.0                1              0
5  35.0  58000.0                0              0
    Age   Salary  Country_Germany  Country_Spain
2  30.0  54000.0                1              0
9  37.0  67000.0                0              0
   Purchased
6          0
4          1
0          0
3          0
1          1
7          1
8          0
5          1
   Purchased
2          0
9          1

In [92]:
from sklearn.preprocessing import StandardScaler
Scaler = StandardScaler()
x_train[:,:2] = Scaler.fit_transform(x_train[:,:2])

array([[-0.28942984, -1.04302547,  0.        ,  1.        ],
       [ 0.        , -0.27672104,  1.        ,  0.        ],
       [ 0.57885968,  0.65987326,  0.        ,  0.        ],
       [-0.28942984, -0.27672104,  0.        ,  1.        ],
       [-1.88129397, -1.38360521,  0.        ,  1.        ],
       [ 1.15771937,  1.25588781,  0.        ,  0.        ],
       [ 1.44714921,  1.59646756,  1.        ,  0.        ],
       [-0.72357461, -0.53215585,  0.        ,  0.        ]])

In [94]:
x_test[:,:2] = Scaler.fit_transform(x_test[:,:2])
x_test

array([[-1., -1.,  1.,  0.],
       [ 1.,  1.,  0.,  0.]])

In [90]:
x_train = x_train.iloc[:,:].values
x_test = x_test.iloc[:,:].values
y_train = y_train.iloc[:,:].values
y_test = y_test.iloc[:,:].values